{
  "speakers": [
    {
      "speaker_image": "assets/images/profile_20190901_223712 - Jacobo de Vera.jpg",
      "speaker_name": "Jacobo de Vera",
      "speaker_desc": "Tras más de diez años escribiendo backends en C++ (y algo de Java, pero no hablemos de eso), consiguió por fin dedicarse a python a tiempo completo (Gracias, Hotjar). Lo mismo te cuenta una #batallita que te explica una keyword, una caja de sorpresas, vamos.",
      "github_url": "https://github.com/jdevera/",
      "linkedin_url": "https://www.linkedin.com/in/jdevera/",
      "session_id": "1",
      "session_start_time": "10:10",
      "session_total_time": "50 Mins",
      "session_title": "Yield, el amigo que no sabías que tenías",
      "session_desc": "Uno puede programar Python durante años sin usar nunca la palabra reservada yield. Detrás de ella se esconda una suerte de \"magia\" cuyos secretos vamos a desvelar hoy. Veremos iteradores, generadores, corutinas, y qué tiene que ver todo eso con yield.",
      "track": "cloud"
    },
    {
      "speaker_image": "assets/images/IMG_3482 - Gisela Rossi.jpg",
      "speaker_name": "Gisela Rossi",
      "speaker_desc": "Gisela Rossi got her Bs. and Ms. in Computer Science with focus on research. She is now a software engineer that has been working with Python for 3 years and believes it is a beautiful and uncluttered language. Gisela loves order and will MariKondo your desk and code if you let her. She is passionate about improving diversity and inclusion in the industry and that is why she became co-leader of PyLadies London. Other interests include oil painting, going to the gym and napping with her kitten.",
      "twitter_url": "https://twitter.com/gise_rossi",
      "session_id": "2",
      "session_start_time": "11:40",
      "session_total_time": "50 Mins",
      "session_title": "Dictionaries, behind the scenes",
      "session_desc": "Have you ever wondered how Python’s dictionaries work behind the scenes? For the curious minds: we will unveil some of the magic, things ranging from performance to security, and some surprises. For the pragmatists: we’ll see cases where understanding the internals can have practical applications.\n\nYou have been working with Python dictionaries for a while and you feel comfortable using them, now you’re interested in taking the next step. With this talk you’ll get a look at how dictionaries work on the inside. You’ll also learn how to personalise your dicts, for example modifying the hash function (and the risks of doing it). You will leave knowing your tools better and loving python dicts even more.",
      "track": "cloud"
    },
    {
      "speaker_image": "assets/images/foto - Oliver Gutiérrez.jpg",
      "speaker_name": "Oliver Gutiérrez",
      "speaker_desc": "Desarrollador especializado en desarrollo web y sistemas Linux. Aunque no me da miedo meterle mano a otras historias, python es mi principal herramienta para todo.",
      "github_url": "https://github.com/olivergs/",
      "linkedin_url": "https://www.linkedin.com/in/olivergutierrez/",
      "twitter_url": "https://twitter.com/R3v1L",
      "session_id": "3",
      "session_start_time": "12:40",
      "session_total_time": "50 Mins",
      "session_title": "Fleet Commander: Despliegue de perfiles de escritorio con Python",
      "session_desc": "Fleet Commander (https://fleet-commander.org) es una herramienta desarrollada en Python cuya misión es servir a los administradores de sistemas para distribuir perfiles de configuración  del escritorio Linux en redes corporativas.\n\nEs una herramienta de código abierto relativamente joven, que utiliza distintas tecnologías simultáneamente para hacer fácil al administrador el crear, gestionar y desplegar perfiles de usuario en sistemas de directorio corporativos.\n\nEn la charla mostraremos un poco cómo se ha desarrollado Fleet Commander desde la perspectiva de Python ",
      "track": "cloud"
    },
    {
      "speaker_image": "assets/images/maite_gimenez - Mai Giménez.JPG",
      "speaker_name": "Mai Giménez",
      "speaker_desc": "Soy una estudiante de doctorado de la Universidad Politécnica de Valencia en Aprendizaje Automático aplicado a Procesamiento del Lenguaje Natural ¡en Python por supuesto!\nFormo parte de la asociación de Python España y he colaborado activamente en la organización de distintas PyConEs, pero de lo que más orgullosa estoy es de formar parte de las Pyladies.\nMi superpoder es la empatía, lo se, ¡es el peor superpoder que existe!",
      "github_url": "https://github.com/maigimenez",
      "linkedin_url": "https://www.linkedin.com/in/maigimenez/",
      "twitter_url": "https://twitter.com/maidotgimenez",
      "session_id": "4",
      "session_start_time": "14:40",
      "session_total_time": "50 Mins",
      "session_title": "Python para valientes",
      "session_desc": "En uno de los anillos del infierno almas descarriadas tienen que tiene que sufrir entrevistas técnicas sin fin. Si eres una de esas personas valientes que han decidido que vas a prepararte para una entrevista técnica y lo harás en Python ¡Estupendo! Esta charla es para ti. En ella revisaremos estructuras de datos, algoritmos en Python. \nY si las palabras \"entrevista técnica\" te dan escalofríos ¡Estupendo! Esta charla es para ti, porque yo era de las tuyas. En esta charla os contaré mi experiencia y estrategias para sobrevivir a ella. ",
      "track": "cloud"
    },
    {
      "speaker_image": "assets/images/amanda_garcia_garcia_pyday - Amanda Garcia.jpg",
      "speaker_name": "Amanda García",
      "speaker_desc": "Ingeniera e investigadora que nunca se cansa de aprender cosas nuevas. Llegué a Python por obligación y he continuado por pasión. Lo puedo utilizar tanto para obtener los resultados de mis experimentos como para diseñar páginas web en mi tiempo libre. Además, supone para mí una comunidad maravillosa de la que formar parte.",
      "session_id": "5",
      "session_start_time": "15:40",
      "session_total_time": "50 Mins",
      "session_title": "La programación ¿una profesión de mujeres?",
      "session_desc": "Durante esta charla conoceremos la asociación PyLadies, a qué nos dedicamos, qué hacemos, nuestra declaración de intenciones y por qué estamos aquí. Haremos un repaso general a la evolución de la mujer en la programación y analizaremos cómo ha ido cambiando el rol en las últimas décadas. ¿Te unes a nuestra comunidad?",
      "track": "cloud"
    },
    {
      "speaker_image": "assets/images/carlos_ble_2018_crop_small - Carlos Blé Jurado.JPG",
      "speaker_name": "Carlos Blé",
      "speaker_desc": "Fundador y director de la empresa Lean Mind.\nDeveloper, emprendedor, autor, mentor, ponente.\nCo-fundador de Agile Canarias y de Agile Spain. ",
      "linkedin_url": "https://linkedin.com/in/carlosble",
      "twitter_url": "https://twitter.com/carlosble",
      "session_id": "6",
      "session_start_time": "17:10",
      "session_total_time": "50 Mins",
      "session_title": "Desarrolladores con impacto",
      "session_desc": "Esta no es una charla técnica sino una charla motivacional sobre nuestra profesión. Sobre la carrera del desarrollador profesional desde mi experiencia en los últimos 20 años. Resaltando la importancia de la comunidad en el desarrollo de las personas. Una charla repleta de historias, donde se hablará de valores, futuro profesional e incluso el futuro del planeta.",
      "track": "cloud"
    },
    {
      "speaker_image": "assets/images/8314643538_670b7107a1_o - Alberto Ruiz.jpg",
      "speaker_name": "Alberto Ruiz",
      "speaker_desc": "Contribuidor del software libre en el ámbito de GNOME y el escritorio libre durante los últimos 15 años.\nActualmente trabajo en Red Hat como director del equipo de habilitamiento de hardware para portatiles y el stack UEFI y de gestión de arranque para RHEL.",
      "github_url": "https://github.com/aruiz",
      "linkedin_url": "https://www.linkedin.com/in/acruiz",
      "twitter_url": "https://twitter.com/acruiz",
      "session_id": "7",
      "session_start_time": "10:10",
      "session_total_time": "50 Mins",
      "session_title": "Módulos de Python en Rust.",
      "session_desc": "Como hacer un módulo Python usando la API de CPython desde Rust para acelerar código o acceder a funcionalidades disponibles en Rust.",
      "track": "web"
    },
    {
      "speaker_image": "assets/images/yo4 - Miguel Jiménez.jpg",
      "speaker_name": "Miguel Jiménez García",
      "speaker_desc": "Muchachito de Castilla que se mudó a la gran ciudad con su maleta llena de sueños e  ilusiones  para afrontar nuevos retos profesionales. Llevo desarrollando con Python + Django desde 2012 y desde el primer contacto con Python caí prendado por el lenguaje. Con Linux, Python y Vim puedo conquistar el mundo. Actualmente trabajo como CTO en la startup ApetEat, el eCommerce que está revolucionando la forma de comer en la oficina.",
      "github_url": "https://github.com/miguelFLG13",
      "linkedin_url": "https://es.linkedin.com/in/miguelflg13",
      "twitter_url": "https://twitter.com/miguelFLG13",
      "telegram_url": "https://t.me/miguelFLG13",
      "session_id": "8",
      "session_start_time": "11:40",
      "session_total_time": "50 Mins",
      "session_title": "2017 Odisea en el Lodo",
      "session_desc": "13 de Marzo de 2017, parece que no hace tanto, pero depende un poco a quien le preguntes. En 2017 Odisea en el lodo se va a intentar contar la experiencia intensa y trepidante que ha supuesto mi incorporación en una startup en continuo crecimiento, en la que me encontré siendo la primera y única persona del equipo de desarrollo con un proyecto heredado. Se explicará en que estado se encontraba el proyecto al principio, la serie de acciones que se han realizado para remolcar un barco que iba a la deriva y el planteamiento para 2018 del stack que tenemos el actual equipo de desarrollo para poder olvidarnos de ese proyecto inicial que me encontré ese 13 de Marzo de 2017.",
      "track": "web"
    },
    {
      "speaker_image": "assets/images/foto - Pablo Manuel García Corzo.jpg",
      "speaker_name": "Pablo Manuel García Corzo",
      "speaker_desc": "As a physicist, I started my career at the Nuclear Physics Group in the Universidad Complutense de Madrid where I became interested in the technical part of the work, linked to computational physics and Linux.\nIn 2012 I left the academic world and I started working for BlueTC as a Python developer and solutions architect specialized in automation, monitoring and analytics.\nToday I'm Technical Account Manager at Intelygenz.",
      "github_url": "https://github.com/ozroc",
      "linkedin_url": "https://www.linkedin.com/in/pablomgc/",
      "twitter_url": "https://twitter.com/pablo_mgc",
      "session_id": "9",
      "session_start_time": "12:40",
      "session_total_time": "50 Mins",
      "session_title": "AIOps: a new revolution you can join with Python",
      "session_desc": "In this talk we will try to understand what exactly is AIOps and what it can do for you. \nWe'll dream a little bit with the inmense power and possibilities of this new paradigm. \nLater on, down to earth, we'll take a look at a set of useful and feasible use cases any DevOps can try thanks to Python.",
      "track": "web"
    },
    {
      "speaker_image": "assets/images/yodra - Yodra Lopez Herrera.png",
      "speaker_name": "Yodra López",
      "speaker_desc": "Ingeniera en Informática de Sistemas, trabaja actualmente en Lean Mind como Desarrolladora FullStack. También es profesora de un programa de emprendimiento juvenil de Programación web FullStack en la EOI (Escuela de Organización Industrial). A lo largo de su carrera ha trabajado en diferentes proyectos tecnológicos de modernización del Gobierno de Canarias. Además es co-organizadora en AdaLoveDev, grupo de desarrolladoras que promueven el papel de las mujeres en el sector.",
      "linkedin_url": "https://www.linkedin.com/in/yodralopez/",
      "twitter_url": "https://twitter.com/yodralopez",
      "session_id": "10",
      "session_start_time": "14:40",
      "session_total_time": "50 Mins",
      "session_title": "Refactorizar y como refactorizar esa es la cuestión",
      "session_desc": "El mantenimiento de nuestro código es vital para escalar nuestros proyectos y que sean fáciles s de mantener. Para ello es importante mejorar nuestro código, y para ello tenemos que refactorizar. Veremos diferentes formas de refactorizar, técnicas que podemos usar para empezar a perderle el miedo y hacer pequeños refactors sin miedo a romper. Tips a tener en cuenta, y como abordar refactors mas complejos.",
      "track": "web"
    },
    {
      "speaker_image": "assets/images/Pedro_Ramos - Pedro Ramos.png",
      "speaker_name": "Pedro Manuel Ramos Rodríguez",
      "speaker_desc": "Graduado en Ingeniería informática por la ULL. Full stack developer en Edosoft Factory. Amante de la tecnología y de la ciencia. Curioso por naturaleza y siempre con ganas de aprender. Apasionado de la visualización de datos y de la ciencia de datos donde cada día intenta aprender más sobre el tema.",
      "github_url": "https://github.com/PedroRamosRguez",
      "linkedin_url": "https://es.linkedin.com/in/pedro-ramos-4a5a41135",
      "twitter_url": "https://twitter.com/pramos90",
      "telegram_url": "https://t.me/pramos90",
      "session_id": "11",
      "session_start_time": "15:40",
      "session_total_time": "50 Mins",
      "session_title": "Detectando TEA usando Machine Learning",
      "session_desc": "En la charla se hablará sobre un modelo realizado para la detección del Trastorno Espectro Autista utilizando algoritmos de machine learning. El objetivo de esta charla, es mostrar que gracias a este tipo de técnicas, es posible ayudar a terapeutas que traten este tipo de trastornos a corroborar sus datos con los del modelo.",
      "track": "web"
    },
    {
      "speaker_image": "assets/images/F1BFC683-FB8F-44BD-A871-23207399C5AE - Laeticia Dos Santos.jpeg",
      "speaker_name": "Laeticia Dos Santos",
      "speaker_desc": "Ingeniera informática especializada en entornos I+D+i, Máster en Big Data y Business Intelligence, apasionada de la ciberseguridad ",
      "linkedin_url": "https://es.linkedin.com/in/laeticiads",
      "twitter_url": "https://twitter.com/letdos",
      "session_id": "12",
      "session_start_time": "17:10",
      "session_total_time": "50 Mins",
      "session_title": "Prophet, como predecir con big data y no morir en el intento",
      "session_desc": "Prophet es un modelo de predicción para series estaciónales que saco facebook en 2017 y que permite realizar forecasting y aplicarlo en las empresa produciendo predicciones que nos ayuden a minimizar gastos ",
      "track": "web"
    }
  ]
}
